mm399-dev-sw/micropython-tiva/ports/tm4c123/main.c
#include <stdint.h>
#include <stdio.h>
#include <stdbool.h>
#include <string.h>

#if defined (ARMCM4)
  #include "ARMCM4.h"
#elif defined (ARMCM4_FP)
  #include "ARMCM4_FP.h"
#else
  #error device not specified!
#endif

#include "system_TM4C123.h"

#include "py/runtime.h"
#include "py/stackctrl.h"
#include "py/gc.h"
#include "py/mphal.h"
#include "py/compile.h"
#include "py/parse.h"
#include "py/mperrno.h"
#include "lib/mp-readline/readline.h"
#include "lib/utils/pyexec.h"
#include "lib/oofatfs/ff.h"
#include "extmod/vfs.h"
#include "extmod/vfs_fat.h"


#include "systick.h"
#include "pendsv.h"
#include "pybthread.h"
#include "gccollect.h"
#include "modmachine.h"
//#include "i2c.h"
//#include "spi.h"
#include "uart.h"
#include "timer.h"
//#include "led.h"
#include "pin.h"
#include "extint.h"
//#include "usrsw.h"
#include "usb.h"
#include "rtc.h"
#include "storage.h"
//#include "sdcard.h"
#include "rng.h"
//#include "accel.h"
//#include "servo.h"
//#include "dac.h"
//#include "can.h"
//#include "modnetwork.h"

// prevent clash between driverlib and CMSIS
#ifdef NVIC_BASE
#undef NVIC_BASE
#endif

#ifdef DWT_BASE
#undef DWT_BASE
#endif

#ifdef ITM_BASE
#undef ITM_BASE
#endif

#include "inc/hw_types.h"
#include "inc/hw_gpio.h"
#include "inc/hw_ints.h"
#include "inc/hw_nvic.h"
#include "inc/hw_memmap.h"
#include "inc/hw_hibernate.h"
#include "driverlib/sysctl.h"
#include "driverlib/systick.h"
#include "driverlib/pin_map.h"
#include "driverlib/gpio.h"
#include "driverlib/rom.h"
#include "driverlib/rom_map.h"

pyb_thread_t pyb_thread_main;
fs_user_mount_t fs_user_mount_flash;
#define led_state(x,y) 
#define PYB_LED_RED     (0)
#define PYB_LED_GREEN   (0)
#define PYB_LED_BLUE    (0)
void flash_error(int n) {
    for (int i = 0; i < n; i++) {
        // TODO
        /* led_state(PYB_LED_RED, 1);
        led_state(PYB_LED_GREEN, 0); */
        mp_hal_delay_ms(250);
        /* led_state(PYB_LED_RED, 0);
        led_state(PYB_LED_GREEN, 1); */
        mp_hal_delay_ms(250);
    }
    led_state(PYB_LED_GREEN, 0);
}

void NORETURN __fatal_error(const char *msg) {
    for (volatile uint delay = 0; delay < 10000000; delay++) {
    }
    //TODO
    /* led_state(1, 1);
    led_state(2, 1);
    led_state(3, 1);
    led_state(4, 1); */
    mp_hal_stdout_tx_strn("\nFATAL ERROR:\n", 14);
    mp_hal_stdout_tx_strn(msg, strlen(msg));
    for (uint i = 0;;) {
        //led_toggle(((i++) & 3) + 1);
        for (volatile uint delay = 0; delay < 10000000; delay++) {
        }
        if (i >= 16) {
            // to conserve power
            __WFI();
        }
    }
}

STATIC mp_obj_t pyb_main(size_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {
    static const mp_arg_t allowed_args[] = {
        { MP_QSTR_opt, MP_ARG_INT, {.u_int = 0} }
    };

    if (MP_OBJ_IS_STR(pos_args[0])) {
        MP_STATE_PORT(pyb_config_main) = pos_args[0];

        // parse args
        mp_arg_val_t args[MP_ARRAY_SIZE(allowed_args)];
        mp_arg_parse_all(n_args - 1, pos_args + 1, kw_args, MP_ARRAY_SIZE(allowed_args), allowed_args, args);
        MP_STATE_VM(mp_optimise_value) = args[0].u_int;
    }
    return mp_const_none;
}
MP_DEFINE_CONST_FUN_OBJ_KW(pyb_main_obj, 1, pyb_main);

void nlr_jump_fail(void *val) {
    printf("FATAL: uncaught exception %p\n", val);
    mp_obj_print_exception(&mp_plat_print, (mp_obj_t)val);
    __fatal_error("");
}

#ifndef NDEBUG
void MP_WEAK __assert_func(const char *file, int line, const char *func, const char *expr) {
    (void)func;
    printf("Assertion '%s' failed, at file %s:%d\n", expr, file, line);
    __fatal_error("");
}
#endif

#if MICROPY_ENABLE_COMPILER
void do_str(const char *src, mp_parse_input_kind_t input_kind) {
    nlr_buf_t nlr;
    if (nlr_push(&nlr) == 0) {
        mp_lexer_t *lex = mp_lexer_new_from_str_len(MP_QSTR__lt_stdin_gt_, src, strlen(src), 0);
        qstr source_name = lex->source_name;
        mp_parse_tree_t parse_tree = mp_parse(lex, input_kind);
        mp_obj_t module_fun = mp_compile(&parse_tree, source_name, MP_EMIT_OPT_NONE, true);
        mp_call_function_0(module_fun);
        nlr_pop();
    } else {
        // uncaught exception
        mp_obj_print_exception(&mp_plat_print, (mp_obj_t)nlr.ret_val);
    }
}
#endif

//extern uint32_t pui32Stack[128];
extern uint32_t __StackTop;
extern uint32_t _heap_start;
extern uint32_t _heap_end;
//static char *stack_top;
#if MICROPY_ENABLE_GC
//static char heap[2048];
#endif

static const char fresh_boot_py[] =
"# boot.py -- run on boot-up\r\n"
"# can run arbitrary Python, but best to keep it minimal\r\n"
"\r\n"
"import machine\r\n"
"import pyb\r\n"
"#pyb.main('main.py') # main script to run after this one\r\n"
#if MICROPY_HW_ENABLE_USB
"#pyb.usb_mode('VCP+MSC') # act as a serial and a storage device\r\n"
"#pyb.usb_mode('VCP+HID') # act as a serial device and a mouse\r\n"
#endif
;

static const char fresh_main_py[] =
"# main.py -- put your code here!\r\n"
;

// TODO
static const char fresh_pybcdc_inf[] =
#include "genhdr/pybcdc_inf.h"
;

static const char fresh_readme_txt[] =
"This is a MicroPython board\r\n"
"\r\n"
"You can get started right away by writing your Python code in 'main.py'.\r\n"
"\r\n"
"For a serial prompt:\r\n"
" - Windows: you need to go to 'Device manager', right click on the unknown device,\r\n"
"   then update the driver software, using the 'pybcdc.inf' file found on this drive.\r\n"
"   Then use a terminal program like Hyperterminal or putty.\r\n"
" - Mac OS X: use the command: screen /dev/tty.usbmodem*\r\n"
" - Linux: use the command: screen /dev/ttyACM0\r\n"
"\r\n"
"Please visit http://micropython.org/help/ for further help.\r\n"
;

// avoid inlining to avoid stack usage within main()
// MP_NOINLINE STATIC bool init_flash_fs(uint reset_mode) {
//     // init the vfs object
//     fs_user_mount_t *vfs_fat = &fs_user_mount_flash;
//     vfs_fat->flags = 0;
//     pyb_flash_init_vfs(vfs_fat);

//     // try to mount the flash
//     FRESULT res = f_mount(&vfs_fat->fatfs);

//     if (reset_mode == 3 || res == FR_NO_FILESYSTEM) {
//         // no filesystem, or asked to reset it, so create a fresh one

