mm399-dev-sw/micropython-tiva/ports/tm4c123/main.c
//         // LED on to indicate creation of LFS
//         led_state(PYB_LED_GREEN, 1);
//         uint32_t start_tick = HAL_GetTick();

//         uint8_t working_buf[_MAX_SS];
//         res = f_mkfs(&vfs_fat->fatfs, FM_FAT, 0, working_buf, sizeof(working_buf));
//         if (res == FR_OK) {
//             // success creating fresh LFS
//         } else {
//             printf("PYB: can't create flash filesystem\n");
//             return false;
//         }

//         // set label
//         f_setlabel(&vfs_fat->fatfs, MICROPY_HW_FLASH_FS_LABEL);

//         // create empty main.py
//         FIL fp;
//         f_open(&vfs_fat->fatfs, &fp, "/main.py", FA_WRITE | FA_CREATE_ALWAYS);
//         UINT n;
//         f_write(&fp, fresh_main_py, sizeof(fresh_main_py) - 1 /* don't count null terminator */, &n);
//         // TODO check we could write n bytes
//         f_close(&fp);

//         // create .inf driver file
//         f_open(&vfs_fat->fatfs, &fp, "/pybcdc.inf", FA_WRITE | FA_CREATE_ALWAYS);
//         f_write(&fp, fresh_pybcdc_inf, sizeof(fresh_pybcdc_inf) - 1 /* don't count null terminator */, &n);
//         f_close(&fp);

//         // create readme file
//         f_open(&vfs_fat->fatfs, &fp, "/README.txt", FA_WRITE | FA_CREATE_ALWAYS);
//         f_write(&fp, fresh_readme_txt, sizeof(fresh_readme_txt) - 1 /* don't count null terminator */, &n);
//         f_close(&fp);

//         // keep LED on for at least 200ms
//         sys_tick_wait_at_least(start_tick, 200);
//         led_state(PYB_LED_GREEN, 0);
//     } else if (res == FR_OK) {
//         // mount sucessful
//     } else {
//     fail:
//         printf("PYB: can't mount flash\n");
//         return false;
//     }

//     // mount the flash device (there should be no other devices mounted at this point)
//     // we allocate this structure on the heap because vfs->next is a root pointer
//     mp_vfs_mount_t *vfs = m_new_obj_maybe(mp_vfs_mount_t);
//     if (vfs == NULL) {
//         goto fail;
//     }
//     vfs->str = "/flash";
//     vfs->len = 6;
//     vfs->obj = MP_OBJ_FROM_PTR(vfs_fat);
//     vfs->next = NULL;
//     MP_STATE_VM(vfs_mount_table) = vfs;

//     // The current directory is used as the boot up directory.
//     // It is set to the internal flash filesystem by default.
//     MP_STATE_PORT(vfs_cur) = vfs;

//     // Make sure we have a /flash/boot.py.  Create it if needed.
//     FILINFO fno;
//     res = f_stat(&vfs_fat->fatfs, "/boot.py", &fno);
//     if (res != FR_OK) {
//         // doesn't exist, create fresh file

//         // LED on to indicate creation of boot.py
//         led_state(PYB_LED_GREEN, 1);
//         uint32_t start_tick = HAL_GetTick();

//         FIL fp;
//         f_open(&vfs_fat->fatfs, &fp, "/boot.py", FA_WRITE | FA_CREATE_ALWAYS);
//         UINT n;
//         f_write(&fp, fresh_boot_py, sizeof(fresh_boot_py) - 1 /* don't count null terminator */, &n);
//         // TODO check we could write n bytes
//         f_close(&fp);

//         // keep LED on for at least 200ms
//         sys_tick_wait_at_least(start_tick, 200);
//         led_state(PYB_LED_GREEN, 0);
//     }

//     return true;
// }

// #if MICROPY_HW_HAS_SDCARD
// STATIC bool init_sdcard_fs(void) {
//     bool first_part = true;
//     for (int part_num = 1; part_num <= 4; ++part_num) {
//         // create vfs object
//         fs_user_mount_t *vfs_fat = m_new_obj_maybe(fs_user_mount_t);
//         mp_vfs_mount_t *vfs = m_new_obj_maybe(mp_vfs_mount_t);
//         if (vfs == NULL || vfs_fat == NULL) {
//             break;
//         }
//         vfs_fat->flags = FSUSER_FREE_OBJ;
//         sdcard_init_vfs(vfs_fat, part_num);

//         // try to mount the partition
//         FRESULT res = f_mount(&vfs_fat->fatfs);

//         if (res != FR_OK) {
//             // couldn't mount
//             m_del_obj(fs_user_mount_t, vfs_fat);
//             m_del_obj(mp_vfs_mount_t, vfs);
//         } else {
//             // mounted via FatFs, now mount the SD partition in the VFS
//             if (first_part) {
//                 // the first available partition is traditionally called "sd" for simplicity
//                 vfs->str = "/sd";
//                 vfs->len = 3;
//             } else {
//                 // subsequent partitions are numbered by their index in the partition table
//                 if (part_num == 2) {
//                     vfs->str = "/sd2";
//                 } else if (part_num == 2) {
//                     vfs->str = "/sd3";
//                 } else {
//                     vfs->str = "/sd4";
//                 }
//                 vfs->len = 4;
//             }
//             vfs->obj = MP_OBJ_FROM_PTR(vfs_fat);
//             vfs->next = NULL;
//             for (mp_vfs_mount_t **m = &MP_STATE_VM(vfs_mount_table);; m = &(*m)->next) {
//                 if (*m == NULL) {
//                     *m = vfs;
//                     break;
//                 }
//             }

//             #if MICROPY_HW_ENABLE_USB
//             if (pyb_usb_storage_medium == PYB_USB_STORAGE_MEDIUM_NONE) {
//                 // if no USB MSC medium is selected then use the SD card
//                 pyb_usb_storage_medium = PYB_USB_STORAGE_MEDIUM_SDCARD;
//             }
//             #endif

//             #if MICROPY_HW_ENABLE_USB
//             // only use SD card as current directory if that's what the USB medium is
//             if (pyb_usb_storage_medium == PYB_USB_STORAGE_MEDIUM_SDCARD)
//             #endif
//             {
//                 if (first_part) {
//                     // use SD card as current directory
//                     MP_STATE_PORT(vfs_cur) = vfs;
//                 }
//             }
//             first_part = false;
//         }
//     }

//     if (first_part) {
//         printf("PYB: can't mount SD card\n");
//         return false;
//     } else {
//         return true;
//     }
// }
// #endif

int tm4c_main(int reset_mode) {

    // Set the priority grouping
    // TODO NVIC_SetPriorityGrouping(NVIC_APINT_PRIGROUP_4_4);

    #if defined(MICROPY_BOARD_EARLY_INIT)
    MICROPY_BOARD_EARLY_INIT();
    #endif

