mm399-dev-sw/micropython-tiva/ports/tm4c123/main.c
    // basic sub-system init
    #if MICROPY_PY_THREAD
    pyb_thread_init(&pyb_thread_main);
    #endif
    // pendsv_init();
    //TODO led_init();
    #if MICROPY_HW_HAS_SWITCH
    switch_init0();
    #endif
    machine_init();
    #if MICROPY_HW_ENABLE_RTC
    rtc_init_start(false);
    #endif
    // TODO spi_init0();
//     #if MICROPY_HW_ENABLE_HW_I2C
//     i2c_init0();
//     #endif
//     #if MICROPY_HW_HAS_SDCARD
//     sdcard_init();
//     #endif
//     storage_init();

// soft_reset:

//     // Python threading init
//     #if MICROPY_PY_THREAD
//     mp_thread_init();
//     #endif
//    int stack_dummy;
    mp_stack_ctrl_init();

    mp_stack_set_top(&__StackTop);
    mp_stack_set_limit((char*)&_estack - (char*)&_heap_end - 1024);

    #if MICROPY_ENABLE_GC
    gc_init(&_heap_start, &_heap_end);
    #endif

    #if MICROPY_ENABLE_PYSTACK
    static mp_obj_t pystack[384];
    mp_pystack_init(pystack, &pystack[384]);
    #endif

    // MicroPython init
    mp_init();
    mp_obj_list_init(mp_sys_path, 0);
    mp_obj_list_append(mp_sys_path, MP_OBJ_NEW_QSTR(MP_QSTR_)); // current dir (or base dir of the script)
    mp_obj_list_init(mp_sys_argv, 0);

    readline_init0();
    pin_init0();
    //TODO extint_init0();
    //TODO timer_init0();
    uart_init0();

    //TODO Missing Repl Config

//     #if MICROPY_HW_ENABLE_USB
//     pyb_usb_init0();
//     #endif

//     // Initialise the local flash filesystem.
//     // Create it if needed, mount in on /flash, and set it as current dir.
//     bool mounted_flash = init_flash_fs(reset_mode);

//     bool mounted_sdcard = false;
// #if MICROPY_HW_HAS_SDCARD
//     // if an SD card is present then mount it on /sd/
//     if (sdcard_is_present()) {
//         // if there is a file in the flash called "SKIPSD", then we don't mount the SD card
//         if (!mounted_flash || f_stat(&fs_user_mount_flash.fatfs, "/SKIPSD", NULL) != FR_OK) {
//             mounted_sdcard = init_sdcard_fs();
//         }
//     }
// #endif

//     #if MICROPY_HW_ENABLE_USB
//     // if the SD card isn't used as the USB MSC medium then use the internal flash
//     if (pyb_usb_storage_medium == PYB_USB_STORAGE_MEDIUM_NONE) {
//         pyb_usb_storage_medium = PYB_USB_STORAGE_MEDIUM_FLASH;
//     }
//     #endif

//     // set sys.path based on mounted filesystems (/sd is first so it can override /flash)
//     if (mounted_sdcard) {
//         mp_obj_list_append(mp_sys_path, MP_OBJ_NEW_QSTR(MP_QSTR__slash_sd));
//         mp_obj_list_append(mp_sys_path, MP_OBJ_NEW_QSTR(MP_QSTR__slash_sd_slash_lib));
//     }
//     if (mounted_flash) {
//         mp_obj_list_append(mp_sys_path, MP_OBJ_NEW_QSTR(MP_QSTR__slash_flash));
//         mp_obj_list_append(mp_sys_path, MP_OBJ_NEW_QSTR(MP_QSTR__slash_flash_slash_lib));
//     }

//     // reset config variables; they should be set by boot.py
//     MP_STATE_PORT(pyb_config_main) = MP_OBJ_NULL;

//     // run boot.py, if it exists
//     // TODO perhaps have pyb.reboot([bootpy]) function to soft-reboot and execute custom boot.py
//     if (reset_mode == 1 || reset_mode == 3) {
//         const char *boot_py = "boot.py";
//         mp_import_stat_t stat = mp_import_stat(boot_py);
//         if (stat == MP_IMPORT_STAT_FILE) {
//             int ret = pyexec_file(boot_py);
//             if (ret & PYEXEC_FORCED_EXIT) {
//                 goto soft_reset_exit;
//             }
//             if (!ret) {
//                 flash_error(4);
//             }
//         }
//     }

//     // turn boot-up LEDs off
// #if !defined(MICROPY_HW_LED2)
//     // If there is only one LED on the board then it's used to signal boot-up
//     // and so we turn it off here.  Otherwise LED(1) is used to indicate dirty
//     // flash cache and so we shouldn't change its state.
//     led_state(1, 0);
// #endif
//     led_state(2, 0);
//     led_state(3, 0);
//     led_state(4, 0);

//     // Now we initialise sub-systems that need configuration from boot.py,
//     // or whose initialisation can be safely deferred until after running
//     // boot.py.

//     #if MICROPY_HW_ENABLE_USB
//     // init USB device to default setting if it was not already configured
//     if (!(pyb_usb_flags & PYB_USB_FLAG_USB_MODE_CALLED)) {
//         pyb_usb_dev_init(USBD_VID, USBD_PID_CDC_MSC, USBD_MODE_CDC_MSC, NULL);
//     }
//     #endif
// // At this point everything is fully configured and initialised.

//     // Run the main script from the current directory.
//     if ((reset_mode == 1 || reset_mode == 3) && pyexec_mode_kind == PYEXEC_MODE_FRIENDLY_REPL) {
//         const char *main_py;
//         if (MP_STATE_PORT(pyb_config_main) == MP_OBJ_NULL) {
//             main_py = "main.py";
//         } else {
//             main_py = mp_obj_str_get_str(MP_STATE_PORT(pyb_config_main));
//         }
//         mp_import_stat_t stat = mp_import_stat(main_py);
//         if (stat == MP_IMPORT_STAT_FILE) {
//             int ret = pyexec_file(main_py);
//             if (ret & PYEXEC_FORCED_EXIT) {
//                 goto soft_reset_exit;
//             }
//             if (!ret) {
//                 flash_error(3);
//             }
//         }
//     }

    // Main script is finished, so now go into REPL mode.
    // The REPL mode can change, or it can request a soft reset.
    for (;;) {
        if (pyexec_mode_kind == PYEXEC_MODE_RAW_REPL) {
            if (pyexec_raw_repl() != 0) {
                break;
            }
        } else {
            if (pyexec_friendly_repl() != 0) {
                break;
            }
        }
    }
    return 0;

// soft_reset_exit:

//     // soft reset

//     printf("PYB: sync filesystems\n");
//     storage_flush();

//     printf("PYB: soft reboot\n");
//     // TODO timer_deinit();
//     uart_deinit();
// #if MICROPY_HW_ENABLE_CAN
//     can_deinit();
// #endif
//     machine_deinit();

//     #if MICROPY_PY_THREAD
//     pyb_thread_deinit();
//     #endif

//     goto soft_reset;
}

//void gc_collect(void) {
//    // WARNING: This gc_collect implementation doesn't try to get root
//    // pointers from CPU registers, and thus may function incorrectly.
//    void *dummy;
//    gc_collect_start();
//    gc_collect_root(&dummy, ((mp_uint_t)stack_top - (mp_uint_t)&dummy) / sizeof(mp_uint_t));
//    gc_collect_end();
//    gc_dump_info();
//}

//void gc_collect(void) {
//
//    gc_collect_start();
//    // get the registers and the sp
//    uintptr_t regs[10];
//    uintptr_t sp = gc_helper_get_regs_and_sp(regs);
//
//    // trace the stack, including the registers (since they live on the stack in this function)
//    #if MICROPY_PY_THREAD
//    gc_collect_root((void**)sp, ((uint32_t)MP_STATE_THREAD(stack_top) - sp) / sizeof(uint32_t));
//    #else
//    gc_collect_root((void**)sp, ((uint32_t)&_ram_end - sp) / sizeof(uint32_t));
//    #endif
//
//    // trace root pointers from any threads
//    #if MICROPY_PY_THREAD
//    mp_thread_gc_others();
//    #endif
//
//    // end the GC
//    gc_collect_end();
//    gc_dump_info();
//}

